require('dotenv').config();
const mongoose = require('mongoose');
const Panneau = require('./models/panneau');

// 📌 Connexion à MongoDB
mongoose.connect(process.env.MONGO_URI, { useNewUrlParser: true, useUnifiedTopology: true })
    .then(() => console.log("✅ Connecté à MongoDB"))
    .catch(err => console.error("❌ Erreur de connexion :", err));

// 📌 Données complètes des panneaux
const panneaux = 
    [
        {
            "categorie": "arret_stop",
            "explication_generale": "تحجز أو تنظم هذه العلامات وقوف أو توقف العربات بمكان أو زمان معين , شكلها و لونها:شكلها دائري أما لونها فهو ازرق وهي محاطة و مشطوبة باللون الأحمر",
            "exemples": [
                { "description": "ممنوع الوقوف" },
                { "description": "ممنوع الوقوف و التوقف" },
                { "description": "ممنوع الوقوف من 1 إلى 15 من الشهر" },
                { "description": "ممنوع الوقوف من 1 إلى 31 من الشهر" },
                { "description": "دخول إلى منطقة يمنع فيها الوقوف" },
                { "description": "دخول إلى منطقة يكون الوقوف فيها بالتداول كل نصف شهر من جهة ولمدة محددة" },
                { "description": "دخول إلى منطقة وقوف بمقابل" },
                { "description": "  خروج منطقة وقوف بمقابل" },
                { "description": "دخول إلى منطقة وقوف محدد بوقت ومراقب باسطوانة" },
                { "description": "ممنوع الوقوف إلى غاية العلامة" },
                { "description": "ممنوع الوقوف على يسار غاية العلامة" },
                { "description": "ممنوع الوقوف ابتداء من العلامة" },
                { "description": "ممنوع الوقوف قبل و بعد العلامة" }
            ]
        },
        {
            "categorie": "interdiction",
        
                "explication_generale": "هي عالمات تنظيمية تحمل تعليمات محددة لمستعملي الطريق يلتزمون بها لتجنب اختلال حركة المرور\n, تعني هذه االعلامات المنع إذا كانت محاطة باللون الأحمر\n,شكلها و لونها : شكلها دائري و لونها أبيض و هي محاطة باللون الأزرق الداكن أو اللون الأسود\n, موضعها : توضع هذه العلامات بصفة عامة ماشرة على جانبي الرصيف أو على الحاشية الترابية قرب مكان المنع\n, يبدأ مفعولها عند العلامة و ينتهي عند المفترق القادم لذلك يجب إعادة تثبيتها بعد كل تقاطع طرقات\n. عند الدخول إلى مواطن العمران, يقطع إعلام مستعملي الطريق بمنع الجولان بواسطة علامات مثبتة بعد علامة الدخول إلى مواطن العمران\n. ولا يطبق المنع إلا على الطريق الذي تم عليه تثبيت علامة المنع\n, علامات نهاية المنع : يكون أيضا شكلها دائري ولونها أبيض إلا أنها مشطوبة بخط أسود",
                "exemples": [
                    { "description": "نهاية جميع الموانع المعلنة سابقا والملزمة للعربات التي هي في حالة سير. نهاية هذه الموانع تشمل كل العربات المتحركة" },
                    { "description": "نهاية منع مجاوزة كل العربات ذات محرك باستثناء تلك التي لها عجلتين و بدون عربة جانبية" },
                    { "description": "نهاية منع المجاوزة بالنسبة لعربات نقل البضائع و التي يفوق وزنها الجملي المرخص 3500 كغ " },
                    { "description": " موانع أخرى يقع التنصيص عليها بكتابة على العلامة" },
                    { "description": "يمنع تجاوز السرعة المبينة بالعلامة" },
                    { "description": "ممنوع الجولان على العربات الناقلة لمواد خطرة" },
                    { "description": "ممنوع الجولان على العربات الناقلة لكمية معينة يمكنها تلويث المياه" },
                    { "description": "ممنوع الجولان على العربات الناقلة لكمية معينة من مواد متفجرة أو سريعة الالتهاب" },
                    { "description": "ممنوع استعمال المنبهات الصوتية" },
                    { "description": "يمنع الجولان دون  ترك مسافة بين العربات لا تقل عن المسافة المبينة بالعلامة" },
                    { "description": "ممنوع الجولان على العربات التي يفوق وزنها على المغزل الواحد 2500 كغ" },
                    { "description": "ممنوع الجولان في الاتجاهين" },
                    { "description": "ممنوع الجولان على العربات التي يفوق علوها باعتبار الحمولة العلو المبين بالعلامة" },
                    { "description": "ممنوع الجولان على العربات التي يفوق عرضها باعتبار الحمولة العرض المبين بالعلامة"}, 
                    { "description": "ممنوع الجولان على العربات و العربات المركبة التي يفوق طولها باعتبار الحمولة الطول المبين بالعلامة" },
                    { "description": "ممنوع المرور على الدراجات النارية الصغيرة" },
                    { "description": "ممنوع الجولان على العربات والمعدات الفلاحية ذات  المحرك" },
                    { "description": "ممنوع الجولان على العربات المجرورة بحيوان" },
                    { "description": "ممنوع الجولان على الدراجات المجرورة باليد " },
                    { "description": "ممنوع الجولان على المترجلين" },
                    { "description": "ممنوع الجولان على عربات نقل البضائع" },
                    { "description": "ممنوع الجولان على العربات ذات  المحرك" },
                    { "description": "ممنوع المرور دون  توقف (شرطة)" },
                    { "description": "ممنوع المرور دون  توقف (ديوانة)" },
                    { "description": "ممنوع على العربات المعدة لنقل البضائع التي يفوق وزنها الجملي المرخص فيه 23500 كغ أن تتجاوز العربات ذات محرك باستثناء العربات ذات  العجلتين غير المجهزة بعربة جانبية" },
                    { "description": " ممنوع مجاوزة كل  العربات ذات محرك باستثناء العربات ذات  العجلتين غير المجهزة بعربة جانبية" },
                    { "description": "فسح مجال المرور للعربات القادمة من الاتجاه المعاكس" },
                    { "description": "ممنوع الجوع على الأعقاب بالطريق المتبع إلى غاية المفترق القادم" },
                    { "description": "ممنوع الدوران على اليمين في المفترق القادم" },
                    { "description": "ممنوع الدوران على اليسار في المفترق القادم" },
                    { "description": "اتجاه ممنوع على كل العربات" },
                    { "description": "نهاية منع إستعمال المنبهات الصوتية" },
                    { "description": "نهاية تحديد السرعة" }
            ]
        },
        {
            "categorie": "danger",
          "explication_generale": "تهدف إشارات وعلامات الخطر إلى تنبيه مستعملي الطريق إلى الأماكن التي يجب عليهم الإنتباه بها بسبب وجود عوائق خطرة,\nوتفرض عليهم تخفيضا من السرعة ملائماً لنوع الخطر المشار إليه.\n\nشكلها و لونها :\nمثلث متساوي الأضلاع، قاعدته أفقية، أما لونها أبيض وهي محاطة بخط أحمر، ويكون الرمز باللون الأسود.\n\nموضعها :\n~ خارج مواطن العمران :\nتوضع علامات الخطر قبل حوالي 150 مترا من بداية المنطقة المعنية بالخطر.\n\n~ داخل مواطن العمران :\nتوضع هذه العلامات على بعد 50 مترا أو أقل من المنطقة المعنية بالخطر.\n\nيمكن وضع هذه العلامات على مسافات أقل من المسافات المذكورة أعلاه،\nوفي هذه الحالة تبين المسافة التقريبية بين العلامة والمكان الخطير بلافتة تكميلية.",


            "exemples": [
                { "description": "مرور حيوانات وحشية" },
                { "description": "مرور حيوانات أهلية" },
                { "description": "منعرج على اليمين " },
                { "description": "منعرج على اليسار" },
                { "description": "منعرجات متتالية أولها على اليسار" },
                { "description": "طريق مسنم" },
                { "description": "مخفض للسرعة" },
                { "description": "طريق ضيق من اليسار" },
                { "description":  "طريق ضيق من اليمين "},
                { "description": "طريق ضيق من الجهتين" },
                { "description": "طريق منزلق" },
                { "description": "جسر متحرك" },
                { "description": "طريق تنتهي إلى رصيف أو حافة نهر" },
                { "description": "الإعلان عن إشارة ضوئية تنظم الجولان" },
                { "description": "خطر مجهول" },
                { "description": "ريتح جانبية" },
                { "description": "جولان في الإتجاهين" },
                { "description": "خطر سقوط حجارة" },
                { "description": "منحدر خطير" },
                { "description": "عبور منطقة بها خطر طيران" },
                { "description": "تقاطع طريق مع سكة حديدية غير محروسة" },
                { "description":  "تقاطغ طريق مع سكة حديدية محروسة" },
                { "description": "مكان يكثر فيه الأطفال" },
                { "description": "مفترق طرقات دوراني" },
                { "description": " تقاطع طريق مع سكة حديديةمحروسة و مجهزة بأسلاك كهربائية" },
                { "description": "علامة مباشرة تعلن عن مكان تقاطع الطريق مع السكة الحديدية. إذا كانت علامة قاطع ومقطوع مكررة فهذا يعني أن تقاطع الطريق مع السكة الحديدية به مسلكين أو أكثر. يمكن أن تكون هذه العلامة مصحوبة بإشارات أوتوماتيكية ضوئية وبجرس يبدأ في العمل 20 ثانية قبل مرور القطار." },
                { "description":  "الاقتراب من تقاطع طريق مع سكة حديدية معلن عنه بهذه الركائز. كل خط أحمر مدهون على الركيزة يبعد 50 متر تقريباً عن مقطع السكة الحديدية." },
                { "description": "ممر للمرتجلين" },
                { "description": "خروج دراجات " },
                { "description": "مرور حيوانات مركوبة" }
                
            ]
        },
        {
            "categorie":"priorite",
             "explication_generale": "تنظيم هذه العلامات السير بالمفترقات و تبين أولويات المرور لضمان سهولة حركة الجولان\n,شكلها و لونها : لها أشكال متعددة لجلب انتباه مستعملي الطريق\n, موضعها : توضع هذه العلامات قرب المفترقات على اليمين و يمكن أن تعاد من أعلى أو يسار المعبد\nيمكن أن تكمل علامات الأولوية بلافتة لرسم السبيل الذي يتمتع فيه السواق بأولوية المرور بالمفتقد القادم",
              "exemples": [
                { "description": "نهاية طريق ذات  أولوية" },
                { "description": "طريق ذات  أولوية. تطبق فيه الأولوية بكل المفترقات" },
                { "description": "افسح المجال في المفترق. تكمل هذه العلامة عادة بخط عرضي متقطع " },
                { "description":" إعلان عن علامة 'قف 'على المسافة التقريبية المبينة" },
                { "description": "توقف عند حد المعبد الذي ستقترب منه مع فسح المجال للعربات القادمة من اليمين و اليسار. توضع هذه العلامة على عين المكان و تكمل بخط عرضي أبيض عند الإقتضاء" },
                { "description": "مفترق مع طريق يجب على مستعمليه ترك الأولوية. لكن لا يقع تطبيق الأولوية إلا بالمفترق القادم" },
                { "description": " مفترق طرقات دوراني يكمل في أغلب الأحيان بلافتة ليس لديك الأولوية و هذه علامة متقدمة تقع الإشارة إليها على عين المكان بعلامة فسح المجال " },

                { "description": "تمثل هذه العلامة ركيزة مفترق تهدف إلى الإشارة إلى مكان المفترق لكنها لا تقدم معلومات عن نظام الأولوية المزمع تطبيقه" },
                { "description": "طريق ذات  أولوية. تمثل اللافتة رسما للمفترق القادم مع الإشارة بواسطة خط سميك لفروع المفترق التي تتمتع بالأولوية" }
            ]
        },
        {
            "categorie": "obligation",
            
                "explication_generale": "هي علامات تنظيميه تجبر مستعملي الطريق على اتباع الاشارات التي تحملها\n,شكلها و لونها : شكلها دائري ولونها ازرق اما نوعيه الجبر فتكون باللون الأبيض\n, موضعها : توضع هذه العلامات بصوره عامه مباشره قرب المكان الذي يبدا فيه الالتزام. ويجب اعاده وضعها بعد كل تقاطع طرقات.\nغير ان بعض العلامات توضع قبل المكان الذي يطبق فيه الالتزام الذي يشير اليه وذلك على مسافه كافيه حسب وضعيه هذا المكان أما علامات نهايه الجبر فيكون شكلها دائري وتكون محاطه باللون الابيض الا انها مشطوبه باللون الاحمر",
              
              "exemples": 
              [

                { "description": "مسلك خاص بعربات الخدمات المنتظمة للنقل الجماعي" },
                { "description": "ادنى سرعه اجباريه" },
                { "description": "سبيل اجباري لركوب الخيل" },
                { "description": "سبيل اجباري للمترجلين" },
                { "description": "مسلك او سبيل اجباري للدراجات الهوائية بدون عربة جانبيه او مجروره"}, 
                { "description": "استعمال سلاسل الثلج اجباري" },
                { "description": "اشعال أضواء السيارة اجباري" },
                { "description": "التفاف دوراني اجباري" },
                { "description": "اتجاه الى الامام او اليسار اجباري في المفترق القادم" },
                { "description": "اتجاه الى اليسار اجباري في المفترق القادم" },
               { "description": "اتجاه الى اليمين اجباري في المفترق القادم" },
               { "description": "اتجاه الى الامام اجباري في المفترق القادم" },
               { "description": "حاجز يجب الإحاطة به من اليسار " },
               { "description": "حاجز يجب الإحاطة به من اليمين" },
               { "description": "الدوران الى اليسار اجباري قبل العلامة" },
               { "description": "الدوران الى اليمين اجباري قبل العلامة" },
               { "description": "اتجاه الى اليمين او اليسار اجباري في المفترق القادم" },
               { "description": "اتجاه الى الامام او اليمين اجباري في المفترق القادم" },
               { "description": "نهاية الرواق الخاص بالدراجات الهوائية" },
               { "description": "نهاية الرواق الاجباري على الراجلين" },
                { "description": " نهاية الرواق الاجباري على الخيالة" },
                 { "description": "نهاية السرعة الادنى الإجبارية" },
                 { "description": "نهاية الاستعمال الاجباري للسلاسل الثلج" },
                 { "description": "نهاية المسلك الاجباري للحافلات" }
            ]
        },
        {
            "categorie": "indication",
            "explication_generale":  "تهدف علامات الإرشاد إلى توجيه مستعملي الطريق وتمكينهم من الحصول على المعلومات الضرورية أثناء السياقة لتسهيل تنقلهم وضمان سلامتهم\n, شكلها ولونها : تأخذ شكلاً مستطيلاً أو مربعاً ولونها يكون أزرق مع رموز أو كتابات باللون الأبيض\n, موضعها : توضع هذه العلامات على جانب الطريق أو فوقه، حسب نوع المعلومات التي تقدمها، لضمان رؤيتها بوضوح من قبل السائقين",
            "exemples": [
                { "description": "سرعه منصوح بها" },
                { "description": "نهايه السرعه منصوح بها" },
                { "description": "حظيره السيارات" },
                { "description": "موقف خاص للمقطورات" },
                { "description": "حظيره سيارات بالدفع"}, 
                { "description": "حظيره خاصه بحافلات النقل العمومي" },
                { "description": "مستشفى" },
                { "description": "طريق بدون منفذ" },
                { "description": "لي اولويه السير على الاتجاه المعاكس" },
                { "description": "توزيع المسالك" },
               { "description": "تخفيض المسالك" },
               { "description": "ممهل" },
               { "description": "مسلك للنجده" },
               { "description": "ممر جبلي مغلق" },
               { "description": "التوقف مسموح على الرصيف" },
               { "description": "نهايه الطريق الخاص بالسيارات" },
               { "description": "موقف سيارات الاجره" },
               { "description": "موقف خاص بالحافلات" },
               { "description": "موقف الترامواي" },
               { "description": "طريق في اتجاه واحد" },
                         { "description": " ممر الراجلين" },
                         { "description": "طريق خاص بالسيارات" },
                         { "description": "مركز اسعاف" },
                         { "description": "مكان للاستراحه" },
                          { "description": "خاص بالمعوقين حركيا" },
                          { "description": "منزل شباب" },
                          { "description": "غابه سريعه الالتهاب" },
                          { "description": "هاتف عمومي" },
                          { "description": "تصليح العجلات" },
                          { "description": "مكان شحن السيارات" },
                          { "description": "مقهى" },
                          { "description": "مطعم" },
                          { "description": "محطه الوقود" },
                         { "description": "هاتف النجده" },
                         { "description": "مركز استعلام سياحي" }
            ]
        },
        {
            "categorie":"temp",
        
                "explication_generale": "لعلامات الوقيه مستعملي الطريق وترشدهم لوجود الحواجز او اخطار او اشغال وقتيه يمكن ان تعترضهم وذلك لحمايتهم وحمايه العاملين بها وتسحب هذه العلامات بزوال سبب وضعها\n,شكلها : تأخذ العلامات الوقتيه جميع اشكال العلامات الاخرى حسب مدلولها\n, موضعها : توضع هذه العلامات على مسافه 150 م او اقل او مباشره على عين المكان حسب نوعيه الخطر",
        
              
            "exemples": [
                { "description": "طريق ضيق" },
                { "description": "مقذوفات حصى" },
                { "description": "طريق مسنم " },
                { "description": " إعلان عن علامة قف على المسافة التقريبية المبينة" },
                { "description": "اوتاد متحركة تسمح او تمنع المرور" },
                { "description": "علامه موضعيه تشير الى تغيير الاتجاه او الى تقلص عرض المعبد" },
                { "description": " مخروط اشغال يشير الى حدود حواجز وقتيه" },
                { "description": "اعلان عن اشاره ضوئية مؤقته تنظم الجولان" },
                { "description": "أخطار مؤقته أخرى يمكن ان تقرن العلامة بلافته تشير الى نوع الخطر" },
                { "description": "أشغال مؤقته " },
                { "description": "طريق زلق مؤقتا " }
            ]
        }
    
]

Panneau.insertMany(panneaux)
    .then(() => {
        console.log("✅ Insertion réussie !");
        mongoose.connection.close();
    })
    .catch(err => {
        console.error("❌ Erreur d'insertion :", err);
        mongoose.connection.close();
    });

// 📌 Fonction pour insérer les panneaux dans MongoDB
async function insertPanneaux() {
    try {
        await Panneau.deleteMany(); // Supprime les anciens panneaux pour éviter les doublons
        await Panneau.insertMany(panneaux);
        console.log("✅ Tous les panneaux ont été insérés avec succès !");
        mongoose.connection.close();
    } catch (error) {
        console.error("❌ Erreur lors de l’insertion :", error);
    }
}

insertPanneaux();
